pmfsampaio/NETMF-LPC/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC178X/DeviceCode/LPC1788_Devices.h
/**********************************************************************
* $Id: LPC177x_8x.h 7485 2011-06-03 07:57:16Z sgg06786 $		LPC177x_8x.h			2011-06-02
*//**
* @file		LPC177x_8x.h
* @brief	Cortex-M3 Core Peripheral Access Layer Header File for
*			NXP LPC177x_8x Series.
* @version	1.0
* @date		02. June. 2011
* @author	NXP MCU SW Application Team
* 
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
**********************************************************************/

#ifndef __LPC1788_DEVICES_H__
#define __LPC1788_DEVICES_H__

#include "./CMSIS/include/LPC177x_8x.h"
#include "./CMSIS/include/core_cm3.h"

//////////////////////////////////////////////////////////////////////////////
// TIMERS
//
struct LPC178X_TIMER
{

    static const UINT32 c_Timer_0 = 0;
    static const UINT32 c_Timer_1 = 1;
    static const UINT32 c_Timer_2 = 2;
    static const UINT32 c_Timer_3 = 3;
    static const UINT32 c_MaxTimer_no = 3;

    static const UINT32 c_TimerBase_0 = LPC_TIM0_BASE;
    static const UINT32 c_TimerBase_1 = LPC_TIM1_BASE;
    static const UINT32 c_TimerBase_2 = LPC_TIM2_BASE;
    static const UINT32 c_TimerBase_3 = LPC_TIM3_BASE;


    /****/ volatile UINT32 IR;     // Interrupt register
           static const    UINT32 MR0_COMP                   = 0x00000001;
           static const    UINT32 MR0_RESET                  = 0x00000001;

    /****/ volatile UINT32 TCR;    // Timer control register
           static const    UINT32 TCR_TEN                    = 0x00000001;

    /****/ volatile UINT32 TC;     // Timer counter
    /****/ volatile UINT32 PR;     // Pre scale register
    /****/ volatile UINT32 PC;     // Pre scale counter register
    /****/ volatile UINT32 MCR;    // Match control register
    /****/ volatile UINT32 MR0;    // Match 0 register
           static const    UINT32 MR0_IRQEN                  = 0x00000001;

    /****/ volatile UINT32 MR1;    // Match 1 register
    /****/ volatile UINT32 MR2;    // Match 2 register
    /****/ volatile UINT32 MR3;    // Match 3 register
    /****/ volatile UINT32 CCR;    // Capture control register
    /****/ volatile UINT32 CR0;    // Capture 0 register
    /****/ volatile UINT32 CR1;    // Capture 1 register
    /****/ volatile UINT32 CR2;    // Capture 2 register
    /****/ volatile UINT32 CR3;    // Capture 3 register
    /****/ volatile UINT32 EMR;    // External match register
    //functions.
    static UINT32 inline getIntNo(int Timer)
    {
        switch (Timer)
        {
        case  c_Timer_0:
            return TIMER0_IRQn;//LPC178X_VIC::c_IRQ_INDEX_TIMER0;
            break;
        case  c_Timer_1:
            return TIMER1_IRQn;//LPC178X_VIC::c_IRQ_INDEX_TIMER1;
            break;
        case  c_Timer_2:
            return TIMER2_IRQn;//LPC178X_VIC::c_IRQ_INDEX_TIMER2;
            break;
        case  c_Timer_3:
            return TIMER3_IRQn;//LPC178X_VIC::c_IRQ_INDEX_TIMER3;
            break;
        default:
            ASSERT(TRUE);
            return(Timer);
            break;
        }
    }
};
//
// TIMER
//////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////
// GP I/O
//
struct LPC178X_GPIO
{
    // Use FAST IO for all ports
    static const UINT32 c_GPIO_Base = LPC_GPIO0_BASE;//  0x3FFFC000;
    static const UINT32 c_GPIO_Irq = GPIO_IRQn;


    //--//

    static const UINT32 c_Pin_None  = 0xFFFFFFFF;
// Controlled by PINSEL0
    static const UINT32 c_P0_00 =   0; // RD1          / TXD3         / SDA1
    static const UINT32 c_P0_01 =   1; // TD1          / RXD3         / SCL1
    static const UINT32 c_P0_02 =   2; // TXD0         / Reserved     / Reserved
    static const UINT32 c_P0_03 =   3; // RXD0         / Reserved     / Reserved
    static const UINT32 c_P0_04 =   4; // I2SRX_CLK    / RD2          / CAP2[0]
                                        // LCDVD[0]
    static const UINT32 c_P0_05 =   5; // I2SRX_WS     / TD2          / CAP2[1]
                                        // LCDVD[1]
    static const UINT32 c_P0_06 =   6; // I2SRX_SDA    / SSEL1        / MAT2[0]
                                        // LCDVD[8]
    static const UINT32 c_P0_07 =   7; // I2STX_CLK    / SCK1         / MAT2[1]
                                        // LCDVD[9]
    static const UINT32 c_P0_08 =   8; // I2STX_WS     / MISO1        / MAT2[2]
                                        // LCDVD[16]
    static const UINT32 c_P0_09 =   9; // I2STX_SDA    / MOSI1        / MAT2[3]
                                        // LCDVD[17]
    static const UINT32 c_P0_10 =  10; // TXD2         / SDA2         / MAT3[0]
    static const UINT32 c_P0_11 =  11; // RXD2         / SCL2         / MAT3[1]
    static const UINT32 c_P0_12 =  12; // USB_PPWR2    / MISO1        / AD0[6]
    static const UINT32 c_P0_13 =  13; // USB_UP_LED2  / MOSI1        / AD0[7]
    static const UINT32 c_P0_14 =  14; // USB_HSTEN2   / USB_CONNECT2 / SSEL1
    static const UINT32 c_P0_15 =  15; // TXD1         / SCK0         / SCK
// Controlled by PINSEL1
    static const UINT32 c_P0_16 =  16; // RXD1         / SSEL0        / SSEL
    static const UINT32 c_P0_17 =  17; // CTS1         / MISO0        / MISO
    static const UINT32 c_P0_18 =  18; // DCD1         / MOSI0        / MOSI
    static const UINT32 c_P0_19 =  19; // DSR1         / MCICLK       / SDA1
    static const UINT32 c_P0_20 =  20; // DTR1         / MCICMD       / SCL1
    static const UINT32 c_P0_21 =  21; // RI1          / MCIPWR       / RD1
    static const UINT32 c_P0_22 =  22; // RTS1         / MCIDAT0      / TD1
    static const UINT32 c_P0_23 =  23; // AD0[0]       / I2SRX_CLK    / CAP3[0]
    static const UINT32 c_P0_24 =  24; // AD0[1]       / I2SRX_WS     / CAP3[1]
    static const UINT32 c_P0_25 =  25; // AD0[2]       / I2SRX_SDA    / TXD3
    static const UINT32 c_P0_26 =  26; // AD0[3]       / AOUT         / RXD3
    static const UINT32 c_P0_27 =  27; // SDA0         / Reserved     / Reserved
    static const UINT32 c_P0_28 =  28; // SCL0         / Reserved     / Reserved
    static const UINT32 c_P0_29 =  29; // USB_D+1      / Reserved     / Reserved
    static const UINT32 c_P0_30 =  30; // USB_D-1      / Reserved     / Reserved
    static const UINT32 c_P0_31 =  31; // USB_D+2      / Reserved     / Reserved
// Controlled by PINSEL2
    static const UINT32 c_P1_00 =  32; // ENET_TXD0    / Reserved     / Reserved
    static const UINT32 c_P1_01 =  33; // ENET_TXD1    / Reserved     / Reserved
    static const UINT32 c_P1_02 =  34; // ENET_TXD2    / MCICLK       / PWM0[1]
    static const UINT32 c_P1_03 =  35; // ENET_TXD3    / MCICMD       / PWM0[2]
    static const UINT32 c_P1_04 =  36; // ENET_TX_EN   / Reserved     / Reserved
    static const UINT32 c_P1_05 =  37; // ENET_TX_ER   / MCIPWR       / PWM0[3]
    static const UINT32 c_P1_06 =  38; // ENET_TX_CLK  / MCIDAT0      / PWM0[4]
    static const UINT32 c_P1_07 =  39; // ENET_COL     / MCIDAT1      / PWM0[5]
    static const UINT32 c_P1_08 =  40; // ENET_CRS_DV  / Reserved     / Reserved
                                        // ENET_CRS
    static const UINT32 c_P1_09 =  41; // ENET_RXD0    / Reserved     / Reserved
    static const UINT32 c_P1_10 =  42; // ENET_RXD1    / Reserved     / Reserved
    static const UINT32 c_P1_11 =  43; // ENET_RXD2    / MCIDAT2      / PWM0[6]
    static const UINT32 c_P1_12 =  44; // ENET_RXD3    / MCIDAT3      / PCAP0[0]
    static const UINT32 c_P1_13 =  45; // ENET_RX_DV   / Reserved     / Reserved
    static const UINT32 c_P1_14 =  46; // ENET_RX_ER   / Reserved     / Reserved
    static const UINT32 c_P1_15 =  47; // ENET_REF_CLK / Reserved     / Reserved
                                        // ENET_CRS
// Controlled by PINSEL3
    static const UINT32 c_P1_16 =  48; // ENET_MDC     / Reserved     / Reserved
    static const UINT32 c_P1_17 =  49; // ENET_MDIO    / Reserved     / Reserved
    static const UINT32 c_P1_18 =  50; // USB_UP_LED1  / PWM1[1]      / CAP1[0]
    static const UINT32 c_P1_19 =  51; // USB_TX_E1    / USB_PPWR1    / CAP1[1]
    static const UINT32 c_P1_20 =  52; // USB_TX_DP1   / PWM1[2]      / SCK0
                                        // LCDVD[6]
                                        // LCDVD[10]
    static const UINT32 c_P1_21 =  53; // USB_TX_DM1   / PWM1[3]      / SSEL0
                                        // LCDVD[7]
                                        // LCDVD[11]
    static const UINT32 c_P1_22 =  54; // USB_RCV1     / USB_PWRD1    / MAT1[0]
                                        // LCDVD[8]
                                        // LCDVD[12]
    static const UINT32 c_P1_23 =  55; // USB_RX_DP1   / PWM1[4]      / MISO0
                                        // LCDVD[9]
                                        // LCDVD[13]
    static const UINT32 c_P1_24 =  56; // USB_RX_DM1   / PWM1[5]      / MOSI0
                                        // LCDVD[10]
                                        // LCDVD[14]
    static const UINT32 c_P1_25 =  57; // USB_LS1      / USB_HSTEN1   / MAT1[1]
                                        // LCDVD[11]
                                        // LCDVD[15]
    static const UINT32 c_P1_26 =  58; // USB_SSPND1   / PWM1[6]      / CAP0[0]
                                        // LCDVD[12]
                                        // LCDVD[20]
    static const UINT32 c_P1_27 =  59; // USB_INT1     / USB_OVRCR1   / CAP0[1]
                                        // LCDVD[13]
                                        // LCDVD[21]
    static const UINT32 c_P1_28 =  60; // USB_SCL1     / PCAP1[0]     / MAT0[0]
                                        // LCDVD[14]
                                        // LCDVD[22]
    static const UINT32 c_P1_29 =  61; // USB_SDA1     / PCAP1[1]     / MAT0[1]
                                        // LCDVD[15]
                                        // LCDVD[23]
    static const UINT32 c_P1_30 =  62; // USB_PWRD2    / VBUS         / AD0[4]
    static const UINT32 c_P1_31 =  63; // USB_OVRCR2   / SCK1         / AD0[5]
// Controlled by PINSEL4
    static const UINT32 c_P2_00 =  64; // PWM1[1]      / TXD1         / TRACECLK
                                        //                             / LCDPWR
    static const UINT32 c_P2_01 =  65; // PWM1[2]      / RXD1         / PIPESTAT0
                                        //                             / LCDLE
    static const UINT32 c_P2_02 =  66; // PWM1[3]      / CTS1         / PIPESTAT1
                                        //                             / LCDDCLK
    static const UINT32 c_P2_03 =  67; // PWM1[4]      / DCD1         / PIPESTAT2
                                        //                             / LCDFP
    static const UINT32 c_P2_04 =  68; // PWM1[5]      / DSR11        / TRACESYNC
                                        //                             / LCDENAB
                                        //                             / LCDM
    static const UINT32 c_P2_05 =  69; // PWM1[6]      / DTR1         / TRACEPKT0
                                        //                             / LCDLP
    static const UINT32 c_P2_06 =  70; // PCAP1[0]     / RI1          / TRACEPKT1
                                        //                             / LCDVD[0]
                                        //                             / LCDVD[4]
    static const UINT32 c_P2_07 =  71; // RD2          / RTS1         / TRACEPKT2
                                        //                             / LCDVD[1]
                                        //                             / LCDVD[5]
    static const UINT32 c_P2_08 =  72; // TD2          / TXD2         / TRACEPKT3
                                        //                             / LCDVD[2]
                                        //                             / LCDVD[6]
    static const UINT32 c_P2_09 =  73; // USB_CONNECT1 / RXD2         / EXTIN0
                                        //                             / LCDVD[3]
                                        //                             / LCDVD[7]
    static const UINT32 c_P2_10 =  74; // EINT0        / Reserved     / Reserved
    static const UINT32 c_P2_11 =  75; // EINT1        / MCIDAT1      / I2STX_CLK
    static const UINT32 c_P2_12 =  76; // EINT2        / MCIDAT2      / I2STX_WS
                                        // LCDVD[4]
                                        // LCDVD[3]
                                        // LCDVD[8]
                                        // LCDVD[18]
    static const UINT32 c_P2_13 =  77; // EINT3        / MCIDAT3      / I2STX_SDA
                                        // LCDVD[5]
                                        // LCDVD[9]
                                        // LCDVD[19]
    static const UINT32 c_P2_14 =  78; // CS2          / CAP2[0]      / SDA1
    static const UINT32 c_P2_15 =  79; // CS3          / CAP2[1]      / SCL1
// Controlled by PINSEL5
    static const UINT32 c_P2_16 =  80; // CAS          / Reserved     / Reserved
    static const UINT32 c_P2_17 =  81; // RAS          / Reserved     / Reserved
    static const UINT32 c_P2_18 =  82; // CLKOUT0      / Reserved     / Reserved
    static const UINT32 c_P2_19 =  83; // CLKOUT1      / Reserved     / Reserved
    static const UINT32 c_P2_20 =  84; // DYCS0        / Reserved     / Reserved
    static const UINT32 c_P2_21 =  85; // DYCS1        / Reserved     / Reserved
    static const UINT32 c_P2_22 =  86; // DYCS2        / CAP3[0]      / SCK0
    static const UINT32 c_P2_23 =  87; // DYCS3        / CAP3[1]      / SSEL0
    static const UINT32 c_P2_24 =  88; // CKEOUT0      / Reserved     / Reserved
    static const UINT32 c_P2_25 =  89; // CKEOUT1      / Reserved     / Reserved
    static const UINT32 c_P2_26 =  90; // CKEOUT2      / MAT3[0]      / MISO0
    static const UINT32 c_P2_27 =  91; // CKEOUT3      / MAT3[1]      / MOSI0
    static const UINT32 c_P2_28 =  92; // DQMOUT0      / Reserved     / Reserved
    static const UINT32 c_P2_29 =  93; // DQMOUT1      / Reserved     / Reserved
    static const UINT32 c_P2_30 =  94; // DQMOUT2      / MAT3[2]      / SDA2
    static const UINT32 c_P2_31 =  95; // DQMOUT3      / MAT3[3]      / SCL2
// Controlled by PINSEL6
    static const UINT32 c_P3_00 =  96; // D0           / Reserved     / Reserved
    static const UINT32 c_P3_01 =  97; // D1           / Reserved     / Reserved
    static const UINT32 c_P3_02 =  98; // D2           / Reserved     / Reserved
    static const UINT32 c_P3_03 =  99; // D3           / Reserved     / Reserved
    static const UINT32 c_P3_04 = 100; // D4           / Reserved     / Reserved
    static const UINT32 c_P3_05 = 101; // D5           / Reserved     / Reserved
    static const UINT32 c_P3_06 = 102; // D6           / Reserved     / Reserved
    static const UINT32 c_P3_07 = 103; // D7           / Reserved     / Reserved
    static const UINT32 c_P3_08 = 104; // D8           / Reserved     / Reserved
    static const UINT32 c_P3_09 = 105; // D9           / Reserved     / Reserved
    static const UINT32 c_P3_10 = 106; // D10          / Reserved     / Reserved
    static const UINT32 c_P3_11 = 107; // D11          / Reserved     / Reserved
    static const UINT32 c_P3_12 = 108; // D12          / Reserved     / Reserved
    static const UINT32 c_P3_13 = 109; // D13          / Reserved     / Reserved
    static const UINT32 c_P3_14 = 110; // D14          / Reserved     / Reserved
    static const UINT32 c_P3_15 = 111; // D15          / Reserved     / Reserved
// Controlled by PINSEL7
    static const UINT32 c_P3_16 = 112; // D16          / PWM0[1]      / TXD1
    static const UINT32 c_P3_17 = 113; // D17          / PWM0[2]      / RXD1
    static const UINT32 c_P3_18 = 114; // D18          / PWM0[3]      / CTS1
    static const UINT32 c_P3_19 = 115; // D19          / PWM0[4]      / DCD1
    static const UINT32 c_P3_20 = 116; // D20          / PWM0[5]      / DSR1
    static const UINT32 c_P3_21 = 117; // D21          / PWM0[6]      / DR1
    static const UINT32 c_P3_22 = 118; // D22          / PCAP0[0]     / RI1
    static const UINT32 c_P3_23 = 119; // D23          / CAP0[0]      / PCAP1[0]
    static const UINT32 c_P3_24 = 120; // D24          / CAP0[1]      / PWM1[1]
    static const UINT32 c_P3_25 = 121; // D25          / MAT0[0]      / PWM1[2]
    static const UINT32 c_P3_26 = 122; // D26          / MAT0[1]      / PWM1[3]
    static const UINT32 c_P3_27 = 123; // D27          / CAP1[0]      / PWM1[4]
    static const UINT32 c_P3_28 = 124; // D28          / CAP1[1]      / PWM1[5]
    static const UINT32 c_P3_29 = 125; // D29          / MAT1[0]      / PWM1[6]
    static const UINT32 c_P3_30 = 126; // D30          / MAT1[1]      / RTS1
    static const UINT32 c_P3_31 = 127; // D31          / MAT1[2]      / Reserved
// Controlled by PINSEL8
    static const UINT32 c_P4_00 = 128; // A0           / Reserved     / Reserved
    static const UINT32 c_P4_01 = 129; // A1           / Reserved     / Reserved
    static const UINT32 c_P4_02 = 130; // A2           / Reserved     / Reserved
    static const UINT32 c_P4_03 = 131; // A3           / Reserved     / Reserved
    static const UINT32 c_P4_04 = 132; // A4           / Reserved     / Reserved
    static const UINT32 c_P4_05 = 133; // A5           / Reserved     / Reserved
    static const UINT32 c_P4_06 = 134; // A6           / Reserved     / Reserved
    static const UINT32 c_P4_07 = 135; // A7           / Reserved     / Reserved
    static const UINT32 c_P4_08 = 136; // A8           / Reserved     / Reserved
    static const UINT32 c_P4_09 = 137; // A9           / Reserved     / Reserved
    static const UINT32 c_P4_10 = 138; // A10          / Reserved     / Reserved
    static const UINT32 c_P4_11 = 139; // A11          / Reserved     / Reserved
    static const UINT32 c_P4_12 = 140; // A12          / Reserved     / Reserved
    static const UINT32 c_P4_13 = 141; // A13          / Reserved     / Reserved
    static const UINT32 c_P4_14 = 142; // A14          / Reserved     / Reserved
    static const UINT32 c_P4_15 = 143; // A15          / Reserved     / Reserved
// Controlled by PINSEL9
    static const UINT32 c_P4_16 = 144; // A16          / Reserved     / Reserved
    static const UINT32 c_P4_17 = 145; // A17          / Reserved     / Reserved
    static const UINT32 c_P4_18 = 146; // A18          / Reserved     / Reserved
    static const UINT32 c_P4_19 = 147; // A19          / Reserved     / Reserved
    static const UINT32 c_P4_20 = 148; // A20          / SDA2         / SCK1
    static const UINT32 c_P4_21 = 149; // A21          / SCL2         / SSEL1
    static const UINT32 c_P4_22 = 150; // A22          / TXD2         / MISO1
    static const UINT32 c_P4_23 = 151; // A23          / RXD2         / MOSI1
    static const UINT32 c_P4_24 = 152; // OE           / Reserved     / Reserved
    static const UINT32 c_P4_25 = 153; // WE           / Reserved     / Reserved
    static const UINT32 c_P4_26 = 154; // BLS0         / Reserved     / Reserved
    static const UINT32 c_P4_27 = 155; // BLS1         / Reserved     / Reserved
    static const UINT32 c_P4_28 = 156; // BLS2         / MAT2[0]      / TXD3 00
                                        //                             / LCDVD[6]
                                        //                             / LCDVD[10]
                                        //                             / LCDVD[2]
    static const UINT32 c_P4_29 = 157; // BLS3         / MAT2[1]      / RXD3
                                        //                             / LCDVD[7]
                                        //                             / LCDVD[11]
                                        //                             / LCDVD[3]
    static const UINT32 c_P4_30 = 158; // CS0          / Reserved     / Reserved
    static const UINT32 c_P4_31 = 159; // CS1          / Reserved     / Reserved

    //--//

    struct
    {
        /****/ volatile UINT32 FIODIR_PX;            // Direction Control
        /****/ volatile UINT32 dummy1;               // filler to align address
        /****/ volatile UINT32 dummy2;               // filler to align address
        /****/ volatile UINT32 dummy3;               // filler to align address
        /****/ volatile UINT32 FIOMASK_PX;           // Pin Mask Register
        /****/ volatile UINT32 FIOPIN_PX;            // Pin Value Register
        /****/ volatile UINT32 FIOSET_PX;            // Data Output Set Register
        /****/ volatile UINT32 FIOCLR_PX;            // Data Output Clear Register
    } Regs[5];

