pmfsampaio/NETMF-LPC/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC178X/DeviceCode/LPC1788_Devices.h
};
    //--//

struct LPC178X_GPIOIRQ
{

    // GPIO IRQ registers for P0 & P2

    static const UINT32 c_GPIOIRQ_Base = LPC_GPIOINT_BASE;

    //GPIO Interrupt registers (port 0 & 2 only can generate IRQs)

    //IRQ Overall Status
    UINT32 volatile IOIntStatus;    // 0x40028080

    ////////////
    // PORT 0 //
    ////////////

    //IRQ Status
    UINT32 volatile IO0IntStatR;    // 0x40028084
    UINT32 volatile IO0IntStatF;    // 0x40028088

    //IRQ Clear
    UINT32 volatile IO0IntClr;        // 0x4002808C

    //IRQ Enable
    UINT32 volatile IO0IntEnR;        // 0x40028090
    UINT32 volatile IO0IntEnF;        // 0x40028094

    //////////////////
    // DUMMY PORT 1 //
    //////////////////

    UINT32 P1_generates_no_irqs[3]; // 0x400280{98-9C-A0} (why did they leave just 3 empty regs?)

    ////////////
    // PORT 2 //
    ////////////

    //IRQ Status
    UINT32 volatile IO2IntStatR;    // 0x400280A4
    UINT32 volatile IO2IntStatF;    // 0x400280A8

    //IRQ Clear
    UINT32 volatile IO2IntClr;        // 0x400280AC

    //IRQ Enable
    UINT32 volatile IO2IntEnR;        // 0x400280B0
    UINT32 volatile IO2IntEnF;        // 0x400280B4


};
//
// GP I/O
//////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// UART
//

struct LPC178X_USART
{
    static const UINT32 c_Uart_0        = 0;
    static const UINT32 c_Uart_1        = 1;
    static const UINT32 c_Uart_2        = 2;
    static const UINT32 c_Uart_3        = 3;
    static const UINT32 c_MaxUart_no     = 3;

    static const UINT32 c_UartBase_0    = LPC_UART0_BASE;
    static const UINT32 c_UartBase_1    = LPC_UART1_BASE;
    static const UINT32 c_UartBase_2    = LPC_UART2_BASE;
    static const UINT32 c_UartBase_3    = LPC_UART3_BASE;

    // UART0 pins
    static const UINT32 c_SER1_TXD = LPC178X_GPIO::c_P0_02;
    static const UINT32 c_SER1_RXD = LPC178X_GPIO::c_P0_03;

    // Add more pins if UART1 is used in full mode
    static const UINT32 c_SER2_TXD = LPC178X_GPIO::c_P3_16;
    static const UINT32 c_SER2_RXD = LPC178X_GPIO::c_P3_17;

    // UART2 pins
    static const UINT32 c_SER3_TXD = LPC178X_GPIO::c_P0_10;
    static const UINT32 c_SER3_RXD = LPC178X_GPIO::c_P0_11;

    // UART3 pins
    static const UINT32 c_SER4_TXD = LPC178X_GPIO::c_P0_00;
    static const UINT32 c_SER4_RXD = LPC178X_GPIO::c_P0_01;


    static const UINT32 c_ClockRate     = 48000000;//LPC178X_UART_PCLK;

    static const UINT32 c_MAX_BAUDRATE = c_ClockRate/16;
    static const UINT32 c_MIN_BAUDRATE = 0;

    //IER
    static const UINT32 UART_IER_RLSIE               = 0x00000004;   //Receive line status interrupt enable.
    static const UINT32 UART_IER_THREIE              = 0x00000002;   //transmit hold register empty interrupt enable.
    static const UINT32 UART_IER_RDAIE               = 0x00000001;   //Receive data available interrupt enable.

    static const UINT32 UART_IER_INTR_ALL_SET        = UART_IER_RLSIE | UART_IER_THREIE | UART_IER_RDAIE;

    //IID
    static const UINT32 UART_IIR_FMES                = 0x00000080;   //FIFO MODE Enable status.
    static const UINT32 UART_IIR_RFTLS_mask          = 0x00000060;   //RX FIFO threshold level status.
    static const UINT32 UART_IIR_RFTLS_shift         =          5;
    static const UINT32 UART_IIR_IID_mask            = 0x0000000F;   //Interrupt identification.
    // values.
    static const UINT32 UART_IIR_IID_Irpt_RLS        = 0x00000006;   // Receiver line status interrupt (e.g. overrun error) .
    static const UINT32 UART_IIR_IID_Irpt_RDA        = 0x00000004;   // Receive data ready interrupt.
    static const UINT32 UART_IIR_IID_Irpt_TOUT       = 0x0000000C;   // Receive FIFO timeout interrupt.
    static const UINT32 UART_IIR_IID_Irpt_THRE       = 0x00000002;   // Transmitter holding register empty.

    static const UINT32 UART_IIR_NIP                 = 0x00000001;   //There is no pending interrupt.

    //FCR
    static const UINT32 UART_FCR_RFITL_mask       = 0x000000C0;     // Rx FIFO trigger level
    static const UINT32 UART_FCR_RFITL_shift      =          6;

    static const UINT32 UART_FCR_RFITL_01         = 0x00000000;
    static const UINT32 UART_FCR_RFITL_04         = 0x00000001;
    static const UINT32 UART_FCR_RFITL_08         = 0x00000002;
    static const UINT32 UART_FCR_RFITL_14         = 0x00000003;

    static const UINT32 UART_FCR_TFR              = 0x00000004;     // Tx FIFO reset
    static const UINT32 UART_FCR_RFR              = 0x00000002;     // Rx FIFO reset
    static const UINT32 UART_FCR_FME              = 0x00000001;     // FIFO Mode enable


    union
    {
        struct
        {
            /****/ volatile UINT32 UART_RBR;                             //receive data register
        } RBR;
        struct
        {
            /****/ volatile UINT32 UART_THR;                            //transmit data register.

        } THR;
        struct
        {
            /****/ volatile UINT32 UART_DLL;                            //Divisor Latch register. (LSB)
        } DLL;

    } SEL1;

    union
    {
        struct
        {
            /****/ volatile UINT32 UART_IER;                                //Interrupt enable register
        } IER;
        struct
        {
            /****/ volatile UINT32 UART_DLM;                               //Divisor Latch register.  (MSB)
        } DLM;
    } SEL2;

    union
    {
        struct
        {
          /****/ volatile UINT32  UART_IIR;                                        //Interrupt identification register.
        } IIR;
        struct
        {
          /****/ volatile UINT32  UART_FCR;
        } FCR;
    } SEL3;

    /****/ volatile UINT32 UART_LCR;                                       // line control register.
    //--//
    static const UINT32 UART_LCR_DLAB                   = 0x00000080;     // Dividor Latch Access bit.
    static const UINT32 UART_LCR_BCB                    = 0x00000040;     // Break control bit.
    static const UINT32 UART_LCR_SPE                    = 0x00000020;     // Stick parity enable.
    static const UINT32 UART_LCR_EPE                    = 0x00000010;     // Even  parity enable.
    static const UINT32 UART_LCR_PBE                    = 0x00000008;     // Parity bit enable.
    static const UINT32 UART_LCR_NSB_1_STOPBITS         = 0x00000000;     // Number of stop bits (0 - 1 stop bit; 1 - 1.5 stop bits).
    static const UINT32 UART_LCR_NSB_15_STOPBITS        = 0x00000004;     // Number of stop bits (0 - 1 stop bit; 1 - 1.5 stop bits).
    static const UINT32 UART_LCR_WLS_mask               = 0x00000003;     // Word length select.
    static const UINT32 UART_LCR_WLS_shift              =          0;
    static const UINT32 UART_LCR_WLS_5_BITS             = 0x00000000;
    static const UINT32 UART_LCR_WLS_6_BITS             = 0x00000001;
    static const UINT32 UART_LCR_WLS_7_BITS             = 0x00000002;
    static const UINT32 UART_LCR_WLS_8_BITS             = 0x00000003;

    /****/ volatile UINT32 UART_MCR;                                       // modem control register.

    /****/ volatile UINT32 UART_LSR;                                       //line status register.
    static const UINT32 UART_LSR_ERR_RX                 = 0x00000080;     //Rx FIFO error
    static const UINT32 UART_LSR_TE                     = 0x00000040;     //Transmitter Empty.
    static const UINT32 UART_LSR_THRE                   = 0x00000020;     //Transmitter Holding register Empty.
    static const UINT32 UART_LSR_BII                    = 0x00000010;     //Break interrupt indicator.
    static const UINT32 UART_LSR_FEI                    = 0x00000008;     //Framing Error indicator.
    static const UINT32 UART_LSR_PEI                    = 0x00000004;     //Parity Error indicator.
    static const UINT32 UART_LSR_OEI                    = 0x00000002;     //Overrun Error indicator.
    static const UINT32 UART_LSR_RFDR                   = 0x00000001;     //RX FIFO data ready.

