pmfsampaio/NETMF-LPC/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC178X/DeviceCode/LPC1788_Devices.h
    /****/ volatile UINT32 UART_MSR;                                   //Modem status register.
    /****/ volatile UINT32 dummy1[3];
    /****/ volatile UINT32 UART_FDR;

    //functions.
    static UINT32 inline getIntNo(int ComPortNum)
    {
        switch (ComPortNum)
        {
        case c_Uart_0:
            return UART0_IRQn+16;//LPC178X_VIC::c_IRQ_INDEX_UART0;
            break;
        case c_Uart_1:
            return UART1_IRQn+16;//LPC178X_VIC::c_IRQ_INDEX_UART1;
            break;
        case c_Uart_2:
            return UART2_IRQn+16;//LPC178X_VIC::c_IRQ_INDEX_UART2;
            break;
        case c_Uart_3:
            return UART3_IRQn+16;//LPC178X_VIC::c_IRQ_INDEX_UART3;
            break;
        default:
            ASSERT(TRUE);
            return(ComPortNum);
            break;
        }
    }
};
//
// UART
//////////////////////////////////////////////////////////////////////////////


struct LPC178X
{
//    static LPC178X_VIC    & VIC    (         ) { return *(LPC178X_VIC*     )(size_t)( LPC178X_VIC     ::c_VIC_Base      ); }
    static LPC178X_GPIO   & GPIO   (         ) { return *(LPC178X_GPIO*    )(size_t)( LPC178X_GPIO    ::c_GPIO_Base     ); }
    static LPC178X_GPIOIRQ& GPIOIRQ(         ) { return *(LPC178X_GPIOIRQ* )(size_t)( LPC178X_GPIOIRQ ::c_GPIOIRQ_Base  ); }
//    static LPC178X_PCB    & PCB    (         ) { return *(LPC178X_PCB*     )(size_t)( LPC178X_PCB     ::c_PCB_Base      ); }
//    static LPC178X_SYSCON & SYSCON (         ) { return *(LPC178X_SYSCON*  )(size_t)( LPC178X_SYSCON  ::c_SYSCON_Base   ); }
//    static LPC178X_EMC    & EMC    (         ) { return *(LPC178X_EMC*     )(size_t)( LPC178X_EMC     ::c_EMC_Base      ); }
//    static LPC178X_SPI    & SPI    ( int sel ) { return *(LPC178X_SPI*     )(size_t)( LPC178X_SPI     ::c_SPI0_Base     ); }
//    static LPC178X_I2C    & I2C    (         ) { return *(LPC178X_I2C*     )(size_t)( LPC178X_I2C     ::c_I2C_Base      ); }
//    static LPC178X_WATCHDOG & WTDG (         ) { return *(LPC178X_WATCHDOG*)(size_t)( LPC178X_WATCHDOG::c_WATCHDOG_Base ); }
//    static LPC178X_DAC      & DAC  (         ) { return *(LPC178X_DAC*     )(size_t)( LPC178X_DAC     ::c_DAC_Base      ); }
//    static LPC178X_PWM      & PWM  ( int sel ) { return *(LPC178X_PWM*     )(size_t)( sel == PWM_CHANNEL_0 ? LPC178X_PWM::c_PWM_Base_0 : LPC178X_PWM::c_PWM_Base_1); }


    static LPC178X_TIMER  & TIMER( int sel )
    {
        ASSERT(sel <=LPC178X_TIMER::c_MaxTimer_no)

        if (sel == LPC178X_TIMER::c_Timer_0)
             return *(LPC178X_TIMER  *)(size_t)LPC178X_TIMER::c_TimerBase_0;
        else if (sel == LPC178X_TIMER::c_Timer_1)
             return *(LPC178X_TIMER  *)(size_t)LPC178X_TIMER::c_TimerBase_1;
        else if (sel == LPC178X_TIMER::c_Timer_2)
             return *(LPC178X_TIMER  *)(size_t)LPC178X_TIMER::c_TimerBase_2;
        else
            return *(LPC178X_TIMER  *)(size_t)LPC178X_TIMER::c_TimerBase_3;
    }


    static LPC178X_USART  & UART( int sel )
    {
        ASSERT(sel <=LPC178X_USART::c_MaxUart_no)
        if (sel == LPC178X_USART::c_Uart_0)
             return *(LPC178X_USART  *)(size_t)LPC178X_USART::c_UartBase_0;
        else if (sel == LPC178X_USART::c_Uart_1)
             return *(LPC178X_USART  *)(size_t)LPC178X_USART::c_UartBase_1;
        else if (sel == LPC178X_USART::c_Uart_2)
             return *(LPC178X_USART  *)(size_t)LPC178X_USART::c_UartBase_2;
        else
             return *(LPC178X_USART  *)(size_t)LPC178X_USART::c_UartBase_3;
    }
//--//
};

//////////////////////////////////////////////////////////////////////////////

/**********************************************************************************************************************/
/**********************************************************************************************************************/
/**********************************************************************************************************************/
/**********************************************************************************************************************/
/**********************************************************************************************************************/


//////////////////////////////////////////////////////////////////////////////
// TIMER driver
//

struct LPC178X_TIMER_Driver
{
    const static UINT32 c_MaxTimers = 4;

    //--//

    BOOL m_configured[c_MaxTimers];

    static BOOL   Initialize   ( UINT32 Timer, HAL_CALLBACK_FPN ISR, void* ISR_Param );
    static BOOL   Uninitialize ( UINT32 Timer                                                                                              );
    static UINT32 ReadCounter  ( UINT32 Timer                                                                                              );

    static void EnableCompareInterrupt( UINT32 Timer )
    {
        ASSERT(Timer < c_MaxTimers);

        LPC178X_TIMER& TIMER = LPC178X::TIMER( Timer );

        TIMER.MCR |= LPC178X_TIMER::MR0_IRQEN;
    }

    static void DisableCompareInterrupt( UINT32 Timer )
    {
        ASSERT(Timer < c_MaxTimers);

        LPC178X_TIMER& TIMER = LPC178X::TIMER( Timer );

        TIMER.MCR &= ~LPC178X_TIMER::MR0_IRQEN;
    }

    static void ForceInterrupt( UINT32 Timer )
    {
        ASSERT(Timer < c_MaxTimers);

        NVIC->STIR = LPC178X_TIMER::getIntNo(Timer);
//        LPC178X::VIC().ForceInterrupt( LPC178X_TIMER::getIntNo(Timer) );
    }

    static void SetCompare( UINT32 Timer, UINT32 Compare )
    {
        ASSERT(Timer < c_MaxTimers);

        LPC178X_TIMER& TIMER = LPC178X::TIMER( Timer );

        TIMER.MR0 = Compare;
    }

    static BOOL DidCompareHit( UINT32 Timer )
    {
        ASSERT(Timer < c_MaxTimers);

        LPC178X_TIMER& TIMER = LPC178X::TIMER( Timer );

        return (TIMER.IR & LPC178X_TIMER::MR0_COMP) != 0;
    }

    static void ResetCompareHit( UINT32 Timer )
    {
        ASSERT(Timer < c_MaxTimers);

        LPC178X_TIMER& TIMER = LPC178X::TIMER( Timer );

        TIMER.IR = LPC178X_TIMER::MR0_RESET;
    }
};

extern LPC178X_TIMER_Driver g_LPC178X_TIMER_Driver;

//
// TIMER driver
//////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// GPIO driver
//

struct LPC178X_GPIO_Driver
{

    struct PIN_ISR_DESCRIPTOR
    {
        HAL_COMPLETION                 m_completion;
        GPIO_INTERRUPT_SERVICE_ROUTINE m_isr;
        void*                          m_param;
        GPIO_PIN                       m_pin;
        GPIO_INT_EDGE                  m_intEdge;
        UINT8                          m_flags;
        UINT8                          m_status;
        UINT32                        m_lastExecTicks;

        //--//

        static const UINT8 c_Flags_Debounce        = 0x01;

        // we are not using these

        /*static const UINT8 c_Flags_RequireLowEdge  = 0x02;
        static const UINT8 c_Flags_RequireHighEdge = 0x04;

        static const UINT8 c_Status_AllowLowEdge   = 0x01;
        static const UINT8 c_Status_AllowHighEdge  = 0x02;*/

        //--//

        static void Fire( void* arg );

        void HandleDebounce( BOOL edge );
    };

    //--//

    static const UINT32 c_MaxPins           =  160;
    static const UINT32 c_MaxPorts          =   5;
    static const UINT32 c_PinsPerPort       =  32;
    static const UINT32 c_PinsPerPCBReg     =  16;

    static const INT32  c_MinDebounceTimeMs =    1; // 1 ms
    static const INT32  c_MaxDebounceTimeMs = 5000; // 5  s

    //--//

    static const UINT8 c_Gpio_Attributes[c_MaxPins];

    // applies to all GPIO
    static const UINT8 c_NumberofResistorMode = 3;
    static const UINT8 c_GPIO_ResistorMode  = (1<<RESISTOR_DISABLED) |(1<<RESISTOR_PULLDOWN) | (1<<RESISTOR_PULLUP) ;

