pmfsampaio/NETMF-LPC/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC178X/DeviceCode/LPC1788_Devices.h
    static const UINT8 c_NumberofInterruptMode = 5;
    static const UINT8 c_GPIO_InterruptMode = (1<<GPIO_INT_EDGE_LOW) | (1<<GPIO_INT_EDGE_HIGH ) | (1<<GPIO_INT_EDGE_BOTH) | (1<<GPIO_INT_LEVEL_HIGH) | (1<<GPIO_INT_LEVEL_LOW);



    PIN_ISR_DESCRIPTOR m_PinIsr            [c_MaxPins ];
    UINT32             m_PinReservationInfo[c_MaxPins];
    UINT32             m_DebounceTicks;

    //--//

    static BOOL Initialize  ();

    static BOOL Uninitialize();

    static UINT32 Attributes( GPIO_PIN Pin );

    static void DisablePin( GPIO_PIN Pin, GPIO_RESISTOR ResistorState, UINT32 Direction, GPIO_ALT_MODE AltFunction);

    static void EnableOutputPin( GPIO_PIN Pin, BOOL InitialState );

    static BOOL EnableInputPin( GPIO_PIN Pin, BOOL GlitchFilterEnable, GPIO_INTERRUPT_SERVICE_ROUTINE ISR, void* ISR_Param, GPIO_INT_EDGE IntEdge, GPIO_RESISTOR ResistorState );

    static BOOL GetPinState( GPIO_PIN Pin );

    static void SetPinState( GPIO_PIN Pin, BOOL PinState );

    static void ISR( void* Param );

    static void SetResistor( GPIO_PIN Pin, GPIO_RESISTOR ResistorState );

    static BOOL PinIsBusy( GPIO_PIN Pin );

    static BOOL ReservePin( GPIO_PIN Pin, BOOL fReserve );

    static UINT32 GetDebounce();

    static BOOL SetDebounce( INT64 debounceTimeMilliseconds );

    static INT32 GetPinCount();

    static void GetPinsMap( UINT8* pins, size_t size );

    static UINT8 GetSupportedResistorModes( GPIO_PIN pin );

    static UINT8 GetSupportedInterruptModes( GPIO_PIN pin );

    static void GPIO_ISR( void* Param );

/*    static void PortConfiguration( UINT32 Port, UINT32 ConfigValue );

    static void PortDirection( UINT32 Port, UINT32 DirValue );

    static UINT32 GetPinBynIRQ( UINT32 nIRQ );

    static UINT32 GetnIRQByPin( UINT32 Pin );

    static BOOL   SetnIRQISR  ( GPIO_PIN pin, HAL_CALLBACK_FPN ISR, GPIO_INT_EDGE intEdge, GPIO_RESISTOR resistorState ) ;*/

private:

    static UINT32 PinToPort( GPIO_PIN pin )
    {
        ASSERT(pin < c_MaxPins);

        return pin / c_PinsPerPort;
    }

    static UINT32 PinToBit( GPIO_PIN pin )
    {
        ASSERT(pin < c_MaxPins);

        return pin % c_PinsPerPort;
    }

    static UINT32 PinToPCBReg( GPIO_PIN pin )
    {
        ASSERT(pin < c_MaxPins);

        return pin / c_PinsPerPCBReg;
    }

    static UINT32 PinToPCBRegBit( GPIO_PIN pin )
    {
        ASSERT(pin < c_MaxPins);

        return ((pin % c_PinsPerPCBReg) * 2);
    }

    static void STUB_ISRVector( GPIO_PIN Pin, BOOL PinState, void* Param );

    //static void nIRQ_ISR( void* Param );
};

extern LPC178X_GPIO_Driver g_LPC178X_GPIO_Driver;

//
// GP I/O driver
//////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////
// NVIC driver
//

// gets the address of the given vector index
#define GET_VECTOR(irqn) *((uint32_t *) &ARM_Vectors + irqn)

// cortex interupts are between -16 and n
#define INTC_TO_NVIC(x) ( (IRQn_Type) (x - 16) )
#define NVIC_TO_INTC(x) ( (UINT32)((int)x + 16) )

struct LPC178X_NVIC_Driver
{
	// pointers for the vectors
	HAL_CALLBACK_FPN intVector[119];

	// pointers for the vector params
	void* intParam[119];

	//static void GlobalNVICISR();
	static void Initialize();
	static BOOL ActivateInterrupt(UINT32 Irq_Index, HAL_CALLBACK_FPN ISR, void* ISR_Param);
	static BOOL DeactivateInterrupt(UINT32 Irq_Index);
	static BOOL InterruptEnable(UINT32 Irq_Index);
	static BOOL InterruptDisable(UINT32 Irq_Index);
	static BOOL InterruptEnableState(UINT32 Irq_Index);
	static BOOL InterruptState(UINT32 Irq_Index);
};

extern LPC178X_NVIC_Driver g_LPC178X_NVIC_Driver;

//
// NVIC driver
//////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// UART driver
//

struct LPC178X_USART_Driver
{
    static const UINT32 c_RefFlagRx = 0x01;
    static const UINT32 c_RefFlagTx = 0x02;

    static const UINT32 c_COM1      = 0;
    static const UINT32 c_COM2      = 1;
    static const UINT32 c_COM3      = 2;
    static const UINT32 c_COM4      = 3;


    INT8 m_RefFlags[2];


    static BOOL Initialize                        ( int ComPortNum, int BaudRate, int Parity, int DataBits, int StopBits, int FlowValue );
    static BOOL Uninitialize                      ( int ComPortNum               );
    static BOOL TxBufferEmpty                     ( int ComPortNum               );
    static BOOL TxShiftRegisterEmpty              ( int ComPortNum               );
    static void WriteCharToTxBuffer               ( int ComPortNum, UINT8 c      );
    static void TxBufferEmptyInterruptEnable      ( int ComPortNum, BOOL Enable  );
    static BOOL TxBufferEmptyInterruptState       ( int ComPortNum               );
    static void RxBufferFullInterruptEnable       ( int ComPortNum, BOOL Enable  );
    static BOOL RxBufferFullInterruptState        ( int ComPortNum               );
    static BOOL TxHandshakeEnabledState           ( int comPortNum               );
    static void ProtectPins                       ( int ComPortNum, BOOL On      );
    static void GetPins                           (int comPort,  GPIO_PIN& rxPin, GPIO_PIN& txPin,GPIO_PIN& ctsPin, GPIO_PIN& rtsPin );
    static void BaudrateBoundary                  (int ComPortNum, UINT32& maxBaudrateHz, UINT32& minBaudrateHz);
    static BOOL IsBaudrateSupported               (int ComPortNum, UINT32 & BaudrateHz);

private:
    static void UART_IntHandler                   ( void *     Param             );
    static BOOL IsValidPortNum                    ( int ComPortNum               );
};

extern LPC178X_USART_Driver g_LPC178X_USART_Driver;

//
// UART driver
//////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// System Time driver
//

struct LPC178X_TIME_Driver
{
    static const UINT32 c_OverflowCheck = 0x80000000;

    UINT64 m_lastRead;
    UINT64 m_nextCompare;

    static BOOL Initialize  ();
    static BOOL Uninitialize();

    static UINT64 CounterValue();

    static void SetCompareValue( UINT64 CompareValue );

    static INT64 TicksToTime( UINT64 Ticks );

    static INT64 CurrentTime();

    static void Sleep_uSec( UINT32 uSec );

    static void Sleep_uSec_Loop( UINT32 uSec );

private:
    static void ISR( void* Param );
};

extern LPC178X_TIME_Driver g_LPC178X_TIME_Driver;

//
// System Time driver
//////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// LPC178X driver
//

struct LPC178X_Driver
{
    static const UINT32 c_SystemTime_Timer         = LPC178X_TIMER::c_Timer_0;

    BOOL             m_PowerOnReset;

    //--//

    static BOOL Initialize();

    static void Pause();

    static void Sleep();

    static void Halt();

    static void Reset();

    static void Shutdown();

    static void Hibernate();

    static BOOL PowerOnReset();

    static BOOL PowerOnReset_STUB();

    static void DisplayProcessorInformation();
};

extern LPC178X_Driver g_LPC178X_Driver;

//
// LPC178X driver
//////////////////////////////////////////////////////////////////////////////


#endif  // __LPC1788_DEVICES_H__
